Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/radio_board/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash — 8 MB, settled from the as-built board: U22 = W25Q64JVXGIQ (64 Mbit).
# This was previously 8 MB for a guess ("devkits are >=8MB, final part TBD");
# it is now 8 MB for a reason. A later board revision fits a W25Q128 (16 MB) —
# 8 MB is the safe value for both, since an 8 MB image runs on a 16 MB part
# while the reverse bricks the boot. Do not raise this to match a schematic
# without checking which board is in your hand. (Reading the flash part off a
# stale field is the OC's 128-of-512 MB mistake, #492.)
#
# That paragraph was right and got overwritten anyway. A 2026-08-22 sweep
# raised the whole fleet to 16 MB on the strength of the CURRENT schematic —
# hardware/lora-daughterboard fits a GD25Q128ESIG — and appended its reasoning
# below this block without removing the argument against it, leaving the file
# asserting both. Reverted 2026-08-24. Unlike the rocket computer this project
# has no board-revision flag to fork on, so the one declaration it gets has to
# be the one that boots on every board, and that is 8 MB.
#
# THE FLEET IS MIXED — corrected 2026-08-27. This block used to say "the
# as-built LoRa Board V3 is the only radio board that has ever run this
# firmware: the 16 MB first article is unflashable (dead flash, still open)".
# That is no longer true. Measured during a flight-readiness pass, both fitted
# daughterboards flashed and booted first time:
#
#   V8 pair  E0:72:A1:CA:F6:7C   8 MB  (GigaDevice c8:6517)
#   V9 pair  E0:72:A1:CA:F6:40  16 MB
#
# Whatever ails the unflashable first article, it is not true of every 16 MB
# board. Do not repeat that claim.
#
# THE 8 MB DECLARATION STAYS, and the mixed fleet is exactly why: it is the one
# value that boots on both, since an 8 MB image runs on a 16 MB part while the
# reverse bricks the boot. Nothing wants the space either — partitions.csv ends
# at 0x320000 (3.2 MB), deliberately, so the same image flashes onto a bench
# devkit too.
#
# So the old conclusion survives its own stale premise: what changed is that
# 8 MB is now load-bearing for a board that EXISTS, not insurance against a
# hypothetical one. If this project ever does need the space, give it the
# TR_BOARD_*-style flag and sdkconfig.defaults.<rev> overlay that
# flight_computer and out_computer use, rather than flipping this line — a
# single declaration cannot serve both parts once it exceeds 8 MB.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM stays OFF — hardware constraint, not a preference, and it holds for
# both board revisions for different reasons. The as-built board fits a plain
# ESP32-S3 (no in-package PSRAM, so there is nothing to enable). The revision
# that fits an S3RH2 has 2 MB of quad PSRAM hanging on VDD_SPI, which in 3.3 V
# mode is fed internally from VDD3P3_RTC through ~14 ohm — and the external
# boot flash shares that node. Flash alone (~25 mA) holds ~2.95 V; flash +
# PSRAM active (~50 mA) sags to ~2.60 V, below both parts' 2.7 V minimum, i.e.
# enabling PSRAM browns out the chip's own boot flash. Do not turn this on
# unless VDD_SPI is re-fed (hardware pre-fab review finding 4).
CONFIG_SPIRAM=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Interrupt WDT
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# Core dump to flash — retrieve after crash with:
#   espcoredump.py info_corefile -t raw -c 0x310000 build/radio_board.elf
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial console on USB (the UART link owns the host pins)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
